module.exports.config = {
  name: "caption",
  version: "1.0.0",
  hasPermssion: 0,
  credits: "—͟͟͞͞𝐂𝐘𝐁𝐄𝐑 ☢️_𖣘 -𝐁𝐎𝐓 ⚠️ 𝑻𝑬𝑨𝑴_ ☢️",
  description: "Send a random islamic caption",
  commandCategory: "fun",
  usages: "caption",
  cooldowns: 5
};

module.exports.run = async ({ api, event }) => {
  const captions = [
    "এক'ম།ত্র ভরস། (الله)🕋🪽",
    "ভালো থাকুক ক্যাপশনে রিয়েক্ট না দেওয়া ব্রয়লার মুরগি'রা...!!🐸𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "বে্ঁয়া্ঁদ্ঁবি্ঁ মা্ঁপ্ঁ ক্ঁর্ঁবে্ঁন্ঁ🫡আ্ঁপ্ঁনা্ঁকে্ঁ এ্ঁক্ঁটা্ঁ থা্ঁপ্প্ঁর্ঁ মা্ঁর্ঁতে্ঁ চা্ঁই্ঁ⎯͢😑⎯⃝💙𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "যখন মায়া বাড়িয়ে লাভ হয় না,তখন মায়া কাটাতে শিখতে হয় _-⎯⃝😅𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "নাই কোনো অভিমান-অভিযোগ, ভাল থাকুক সে𑁍❀☹️𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "সময়ের পরিবর্তনে রাগ, অভিমান কমে যায়, -কিন্তু কারো দেয়া আঘাতের দাগ গুলা থেকে যায়..! 😌𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "মানুষ মাঝে মাঝে রাগ করতে করতে রাগের কারনটাই ভুলে যায় °`-শুধু থেকে যায় কিছু অভিমান..! 😊🤗",
    "°<নীরবতারও ভাষা আছে,এটা -শুধু খুব কাছের কেউই বুঝতে পারে।😊🙏𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "প্রেমের সম্পর্ক অনেকটা পদ্ম পাতার ওপর এক ফোঁটা জলের মতো °`<যত্ন না করলে যে কোনো সময় 𑁍ভেঙ্গে যেতে পারে..! 🥰🫶𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "অভিমানী মন অভিমানী এই রয়ে যায় তবুও কেউ অভিমান ভাঙাতে আসেনা.. 😅🤗𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "অন্যের ওপরে অভিমান করে নিজেকে কষ্ট দেওয়া মানুষগুলি মারাত্মক বোকা..! 😵💔",
    "হয়তো তোমাকে হারিয়ে দিয়েছি নয় তো গিয়েছি হেরে থাক না ধ্রুপদী অস্পষ্টতাকে কাকে গেলাম ছেড়ে..  _-⎯⃝  🩷𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "ধৈর্যশীল ব্যক্তির ক্রোধ থেকে সাবধান..!☠️🤝",
    "একমাত্র সৎ ব্যক্তিরাই অন্যকে কঠোরভাবে তিরস্কার করতে পারে😊🥰𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "যে নদীর গভীরতা বেশি, তার বয়ে যাওয়ার শব্দ কম..!🤗𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "তুমি যদি কোনো লোককে জানতে চাও -তাহলে তাকে প্রথমে ভালোবাসতে শেখো..!🥰𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "সুন্দর একটা মানুষ না খুঁজে🤗 সুন্দর একটা মন খুঁজো🥰 তাহলে ভালোবাসার সফলতা আসবে..!😌𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "প্রেম নারীর লজ্জাশীলতাকে গ্রাস করে পুরুষের বাড়ায়..!☠️🤝𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "প্রেমের ক্ষেত্রে জয়ী হয়ে কেউ শিল্পী হতে পারে না বড় জোর বিয়ে করতে পারে..🤗𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "একাকীত্ব তখনই মানুষ অনুভব করে যখন সে নিজের সাথে কথা বলে কারণ তখন কেউ তার কথা শোনার মত থাকে না..!🥰🫶𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "বিচ্ছিন্নতার অনুভূতি সৃষ্টি করে একাকীত্ব..! _-✿︎ যা পরিশেষে মানুষের জীবনকে চরম কষ্ট প্রদান করে.. _-⎯⃝ 🥰𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "শূন্যতায় ভরা এ জগৎ সংসার সুখ-দুঃখ ভরা সব অতৃপ্তআত্না সুখ অনুভবে...তবু সুখ বলে কিছু নেই...দুঃখ সে তো শাশ্বত শূন্যের হাহাকার..!𑁍𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "অসৎ মানুষের সঙ্গ লাভ করার থেকে নিঃসঙ্গতা ও একাকীত্ব অধিকতর শ্রেয়..!😊🤝𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "অবসর সময়ে নিজের সঙ্গকে উপভোগ করার জন্য একাকিত্ব অপরিহার্য..!☹️🫶𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "তুমি ছাড়া অন্য কোন কিছুই তোমাকে নিজের মত করে সুখী করতে সক্ষম নয়..!😊💔𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "আজকাল আমরা সবাই নিজের ego satisfy করতে ব্যস্ত..☹️𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "মাঝে মাঝেই ভাবি যে ভালো হয়ে যাবো -তারপরেই মনে হয় আমি খারাপ ছিলাম কবে..?🥱𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "Perfect না হতে পারি..! তবে সস্তা নয়..!🥱𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "যে অন্যের দোষ তোমাকে বলে..🙃 সে নিশ্চয়ই তোমার দোষও অপরকে বলে.!😊🙏𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "আমাকে ভাই বলার অধিকার শুধু আমার বন্ধুদের আছে..!🥰 নয়তো শত্রুরা আজও আমাকে বাবা বলে ডাকে..!🥱🤝𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "অন্যের মুখে শোনা কথা তাড়াতাড়ি না বিশ্বাস করাই ভালো..কারণ সত্যের তুলনায় মিথ্যা দ্রুতই ছড়িয়ে পড়ে..!😊𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "তুমি জানো তুমি সঠিক..তবুও তুমি তর্কে যেও না.!😌𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "মৃত্যু যেখানে সময়ের ব্যাপার মাত্র..সেখানে রঙিন স্বপ্ন বড়ই বে মানান..😌🫶𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "দক্ষতা জিনিসগুলি সঠিকভাবে করছে..কার্যকারিতা সঠিক জিনিসগুলি করছে🥰🤝𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "মানুষ খুব কমই সফল হয় যদি না তারা যা করছে তাতে আনন্দ পায়😌🙏𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "নিজেকে ইতিবাচক ব্যক্তিদের চারপাশে ঘিরে রাখুন তাহলে আপনিও একজন ইতিবাচক ব্যক্তি হবেন..😊🫶𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "মন খারাপ গুলোকে..হাসির আঁড়ালে লুকিয়ে..রাখার অভ্যাসটা আজও ছাড়তে পারলাম না!😊💔𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "ছোট একটা ভুলের জন্য যে চিরদিনের জন্য ছেড়ে চলে যায়..সে আসলে কখনো পাশে থাকার যোগ্যই ছিলো না..!😊🤝𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "জানি সে আমার নয়..!😌তবু তাকে হারানোর ভয়..😊🙏𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "ভুল হলে শুধরে দেওয়াটা হচ্ছে ভালোবাসা..!ফেলে চলে যাওয়াটা হচ্ছে বেইমানি..!😌💔𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "মুখোশধারী ভদ্র হওয়ার চেয়ে..!😵 স্পষ্টবাদী অভদ্র হওয়া অনেক ভালো..!😌𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "Dear Ex আজও তোর কথা মনে পড়লে ভাবি আমার Choice এতটা খারাপ ছিল..!🥴🥱𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "জীবনে সব কিছুকে আঁকড়ে ধরতে নেই..!😊💔𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯",
    "আমি স্বার্থপর নই! -শুধু তাদের থেকে দূরে সরে যাই..যাদের কাছে আমার কোনো মূল্য নেই..!😊🫶𝐊𝐢𝐧𝐠_𝐒𝐡𝐨𝐮𝐫𝐨𝐯"
  ];

  const randomIndex = Math.floor(Math.random() * captions.length);
  const message = captions[randomIndex];
  
  return api.sendMessage(message, event.threadID);
};